# Inicialiação do ambiente
Aluna: Amanda Luiza Ilg

In [2]:
import sqlite3

In [3]:
conexao = sqlite3.connect('banco')
cursor = conexao.cursor()

# Exercicio 1
Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto)

In [4]:
cursor.execute('CREATE TABLE alunos(id INT,nome VARCHAR(50),idade INT,curso VARCHAR(30))')

# Exercicio 2
Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [5]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(1,"Amanda",19,"Data Analytics"), (2,"Arthur",19,"Segurança da Informação"),(3,"Lucas",17,"Música"),(4,"Elenice",39,"Programação"),(5,"Gabriele",25,"Engenharia")')

# Exercicio 3
Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [6]:
cursor.execute('SELECT * FROM alunos')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [8]:
cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [7]:
cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia ORDER BY nome"')

d) Contar o número total de alunos na tabela

In [9]:
cursor.execute('SELECT COUNT(id) FROM alunos')

# Exercicio 4
Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

In [ ]:
cursor.execute('UPDATE alunos SET idade = 36 WHERE nome = "Gabriele"')

b) Remova um aluno pelo seu ID.

In [ ]:
cursor.execute('DELETE FROM alunos WHERE id = 3')

# Exercicio 5
Criar uma Tabela e Inserir Dados
Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [ ]:
cursor.execute('CREATE TABLE clientes(id INT, nome VARCHAR(50), idade INT, saldo FLOAT, primary key(id))')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (1,"Leonardo",27,80.5), (2,"Juliana",18,40), (3,"Jarbas",57,1050.8), (4,"Eduarda",35,2000)')

# Exercicio 6
Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

In [ ]:
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')

b) Calcule o saldo médio dos clientes

In [ ]:
cursor.execute('SELECT AVG(saldo) FROM clientes')

c) Encontre o cliente com o saldo máximo.

In [ ]:
cursor.execute('SELECT nome, MAX(saldo) FROM clientes')

d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
cursor.execute('SELECT COUNT(id) FROM clientes WHERE saldo > 1000')

# Exercicio 7
Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [ ]:
cursor.execute('UPDATE clientes SET saldo = 900 WHERE nome = "Leonardo"')

b) Remova um cliente pelo seu ID

In [ ]:
cursor.execute('DELETE FROM clientes WHERE id = 2')

# Exercicio 8
Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [ ]:
cursor.execute('CREATE TABLE compras(id INT, produto VARCHAR(50), cliente_id INT, valor FLOAT, primary key(id), foreign key(cliente_id) REFERENCES clientes(id))')

In [ ]:
cursor.execute('INSERT INTO compras(id,produto,cliente_id,valor) VALUES (1,"Chocolate",3,15), (2,"Macarrão",1,10), (3,"Energetico",4,50.5), (4,"Frango",1,73.4)')

In [ ]:
cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM compras FULL JOIN clientes ON compras.cliente_id = clientes.id')

# Finalização Variáveis

In [ ]:
conexao.commit()
conexao.close